src/cf/Catalogs/НастройкиИнтеграцииCRM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиИнтеграцииCRM</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияФормата</Name>
					<Comment>Используемая версия формата EnterpriseData</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыИнтеграцииCRM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыИнтеграцииCRM</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектовИнтеграцииCRM</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеграцииCRM</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыСинхронизацииCRM</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/НастройкиИнтеграцииCRM/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейсБТС

// Возвращает двоичные данные и идентификатор обработчика объекта,
// которые будут переданы в составе zip-архива во внешнюю учетную систему.
//
// Параметры:
//  УчетнаяСистема - ОпределяемыйТип.УчетныеСистемыИнтеграцииОбластейДанных
//  ИдентификаторОбъекта - Строка(50) - идентификатор объекта. 
//  Обработчик - Строка(50) - обработчик данных объекта. 
// 
// Возвращаемое значение:
//   - ДвоичныеДанные - данные объекта. 
//
Функция ДанныеОбъекта(УчетнаяСистема, ИдентификаторОбъекта, Обработчик) Экспорт
	
	СсылкаНаОбъект = РегистрыСведений.ОбъектыИнтеграцииCRM.ОбъектПоИдентификатору(ИдентификаторОбъекта);
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru='По идентификатору %1 не найден объект'"), ИдентификаторОбъекта);
	КонецЕсли;
	
	Возврат РегистрыСведений.ОбъектыИнтеграцииCRM.ДвоичныеДанныеОбъектаДляОтправки(
		СсылкаНаОбъект, УчетнаяСистема, Обработчик);
	
КонецФункции

// Предназначен для обработки подтверждений, полученных от учетной системы после принятия файлов данных.
// В ней можно определить действия с интегрируемыми объектами, по которым пришли подтверждения.
//
// Параметры:
//  УчетнаяСистема - ОпределяемыйТип.УчетныеСистемыИнтеграцииОбластейДанных
//  Подтверждения - Соответствие
//                  * Ключ - Строка - это идентификатор объекта
//                  * Значение - Структура
//                      ** Версия - Строка - версия объекта
//                      ** Версия - Строка - версия объекта
//                      ** КодВозврата - Число - код возврата, определяется во внешней учетной системе.
//                         Рекомендуемые коды возврата см. в процедуре ИнтеграцияОбъектовОбластейДанныхПовтИсп.КодыВозврата
//                      ** Ошибка - Булево - признак ошибки (по умолчанию - Ложь)
//                      ** СообщениеОбОшибке - Строка - подробности ошибки (по умолчанию не заполнено)
//  СтандартнаяОбработка - Булево - признак стандартной обработки. Если Ложь, то обработанные объекты 
//                       не будут удалены из списка объектов к отправке.
//
Процедура ОбработатьПодтверждения(УчетнаяСистема, Подтверждения, СтандартнаяОбработка) Экспорт
	
	Для Каждого Подтверждение Из Подтверждения Цикл
		
		СсылкаНаОбъект = РегистрыСведений.ОбъектыИнтеграцииCRM.ОбъектПоИдентификатору(Подтверждение.Ключ);
		
		Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Подтверждение.Значение.Ошибка Тогда
			РегистрыСведений.ОбъектыИнтеграцииCRM.УстановитьСостояниеОшибкаПередачи(
				СсылкаНаОбъект, УчетнаяСистема, Подтверждение.Значение.СообщениеОбОшибке);
		Иначе
			РегистрыСведений.ОбъектыИнтеграцииCRM.УстановитьСостояниеОбъектСинхронизировано(
				СсылкаНаОбъект, УчетнаяСистема, Подтверждение.Ключ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Предназначена для обработки данных объектов, получаемых от внешней учетной системы.
//
// Параметры:
//  УчетнаяСистема - ОпределяемыйТип.УчетныеСистемыИнтеграцииОбластейДанных - учетная система.
//  ИдентификаторОбъекта - Строка(50) - идентификатор объекта для обработка
//  ПотокДанных - ФайловыйПоток, ПотокВПамяти - данные объекта
//  Обработчик - Строка - идентификатор обработчика
//  КодВозврата - Число - код возврата обработчика (по умолчанию - 10200)
//  Ошибка - Булево - признак ошибки (по умолчанию - Ложь)
//  СообщениеОбОшибке - Строка - подробности ошибки (по умолчанию не заполнено).
//
Процедура ОбработатьДанные(УчетнаяСистема, ИдентификаторОбъекта, ПотокДанных, Обработчик, КодВозврата, Ошибка, СообщениеОбОшибке) Экспорт
	
	РегистрыСведений.ОбъектыИнтеграцииCRM.ОбработатьДанные(УчетнаяСистема, ИдентификаторОбъекта,
		ПотокДанных, Обработчик, КодВозврата, Ошибка, СообщениеОбОшибке);
	
КонецПроцедуры

// Предназначена для обработки устанавливаемых настроек учетной системы, 
// полученных от внешней учетной системы.
//
// Параметры:
//  УчетнаяСистема - ОпределяемыйТип.УчетныеСистемыИнтеграцииОбластейДанных 
//  ПотокДанных - ФайловыйПоток, ПотокВПамяти - данные настроек (передаются в формате json) 
//  КодВозврата - Число - код возврата обработчика установки настроек (по умолчанию - 10200).
//  Ошибка - Булево - признак ошибки (по умолчанию - Ложь) 
//  СообщениеОбОшибке - Строка - подробности ошибки (по умолчанию не заполнено).
//  СтандартнаяОбработка - Булево - признак стандартной обработки. 
//
Процедура УстановитьНастройки(УчетнаяСистема, ПотокДанных, КодВозврата, Ошибка, СообщениеОбОшибке) Экспорт
	
	Объект = УчетнаяСистема.ПолучитьОбъект();
	Данные = СтруктураИзПотокаJSON(ПотокДанных);
	
	ВерсияФормата = Неопределено;
	Использование = Неопределено;
	
	Данные.Свойство("version_ed", ВерсияФормата);
	Данные.Свойство("status", Использование);
	
	Если НРег(Использование) = "on" Тогда
		Использование = Истина;
	ИначеЕсли НРег(Использование) = "off" Тогда
		Использование = Ложь;
	Иначе
		Использование = Истина;
	КонецЕсли;
	
	Если ВерсияФормата <> Неопределено Тогда
		Объект.ВерсияФормата = ВерсияФормата;
	КонецЕсли;
	Объект.Используется = Использование;
	Объект.Записать();
	
	ВключитьИнтерфейсODATA();
	
	УстановитьПраваПользователяИнтеграции(УчетнаяСистема);
	
КонецПроцедуры

// Возвращает идентификатор типа учетной системы для определения менеджера объекта, 
// если ссылки на учетную систему с пользователем обратившейся внешней системы еще не существует.
// Возвращаемое значение:
//   - Строка
//
Функция ТипУчетнойСистемы() Экспорт
	
	Возврат "crm";
	
КонецФункции

// Обработчик выполнения команды от учетной системы.
//
// УчетнаяСистема      - ОпределяемыйТип.УчетныеСистемыИнтеграцииОбластейДанных - учетная система.
// ПотокДанныхКоманды  - ФайловыйПоток, ПотокВПамяти - данные команды.
// КодВозврата         - Число  - код возврата обработчика (по умолчанию - 10200)
// Ошибка              - Булево - признак ошибки (по умолчанию - Ложь)
// СообщениеОбОшибке   - Строка - подробности ошибки (по умолчанию не заполнено).
// 
// Возвращаемое значение:
//   - Неопределено - если не подразумевается создание объектов, или в процессе выполнения произошла ошибка.
//   - ТаблицаЗначений - результаты выполнения команды, информация о созданных или измененных объектах
//                       (см. функцию ИнтеграцияОбъектовОбластейДанных.НовыйРезультатыВыполненияКоманды)
//
Функция ВыполнитьКоманду(УчетнаяСистема, ПотокДанныхКоманды, КодВозврата, Ошибка, СообщениеОбОшибке) Экспорт
	
	ДанныеКоманды = СтруктураИзПотокаJSON(ПотокДанныхКоманды, "date");
	
	ПроверитьКорректностьДанныхКоманды(ДанныеКоманды, Ошибка, СообщениеОбОшибке);
	
	РезультатВыполнения = ИнтеграцияОбъектовОбластейДанных.НовыйРезультатыВыполненияКоманды();
	
	Если НЕ Ошибка Тогда
		ВыполнитьКомандуУчетнойСистемы(УчетнаяСистема, ДанныеКоманды, РезультатВыполнения, Ошибка, СообщениеОбОшибке);
	КонецЕсли;
	
	Если Ошибка Тогда
		КодВозврата = ИнтеграцияОбъектовОбластейДанныхСловарь.КодВозвратаОшибкаДанных();
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает Истина, если в базе есть хотя бы одна действующая настройка интеграции c CRM.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ИнтеграцияВИнформационнойБазеВключена() Экспорт
	
	Если НЕ ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиИнтеграцииCRM.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиИнтеграцииCRM КАК НастройкиИнтеграцииCRM
	|ГДЕ
	|	НастройкиИнтеграцииCRM.Используется
	|	И НЕ НастройкиИнтеграцииCRM.ПометкаУдаления";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураИзПотокаJSON(ПотокДанных, ПоляТипаДата = Неопределено)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(ПотокДанных);
	Ответ = ПрочитатьJSON(ЧтениеJSON,, ПоляТипаДата, ФорматДатыJSON.ISO);
	ЧтениеJSON.Закрыть();
	
	Возврат Ответ;
	
КонецФункции

#Область НастройкиИнтеграции

Процедура ВключитьИнтерфейсODATA()
	
	ОбъектыМетаданных = Новый Массив;
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.Номенклатура);
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.ХарактеристикиНоменклатуры);
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.ЕдиницыИзмерения);
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.КлассификаторЕдиницИзмерения);
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.КатегорииНоменклатуры);
	
	ОбъектыМетаданных.Добавить(Метаданные.РегистрыСведений.ЦеныНоменклатуры);
	
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.ВидыЗаказовПокупателей);
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.СостоянияЗаказовПокупателей);
	
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.Сотрудники);
	ОбъектыМетаданных.Добавить(Метаданные.Справочники.ФизическиеЛица);
	
	УстановитьСоставСтандартногоИнтерфейсаOData(ОбъектыМетаданных);
	
КонецПроцедуры

Процедура УстановитьПраваПользователяИнтеграции(НастройкиИнтеграции)
	
	Пользователь = ПользовательИнтеграцииCRM(НастройкиИнтеграции);
	Если ЗначениеЗаполнено(Пользователь) Тогда
		УправлениеДоступомУНФ.ОбновитьДоступСлужебногоПользователяКAPI(Пользователь, Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ПользовательИнтеграцииCRM(НастройкиИнтеграции)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиУчетныхСистем.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.НастройкиУчетныхСистем КАК НастройкиУчетныхСистем
	|ГДЕ
	|	НастройкиУчетныхСистем.УчетнаяСистема = &УчетнаяСистема
	|	И НЕ НастройкиУчетныхСистем.УчетнаяСистема.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("УчетнаяСистема", НастройкиИнтеграции);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Пользователь;
	КонецЕсли;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#Область ВыполнениеКоманды

Процедура ПроверитьКорректностьДанныхКоманды(ДанныеКоманды, Ошибка, СообщениеОбОшибке)
	
	Если НЕ ДанныеКоманды.Свойство("method") Тогда
		Ошибка = Истина;
		СообщениеОбОшибке = НСтр("ru = 'В структуре JSON отсутствует обязательное поле method'");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеКоманды.method) Тогда
		Ошибка = Истина;
		СообщениеОбОшибке = НСтр("ru = 'Поле method не заполнено'");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКомандуУчетнойСистемы(УчетнаяСистема, ДанныеКоманды, РезультатВыполнения, Ошибка, СообщениеОбОшибке)
	
	ИмяМетода = ДанныеКоманды.method;
	
	Параметры = Неопределено;
	ДанныеКоманды.Свойство("parameters", Параметры);
	
	Если ИмяМетода = ИмяМетодаНоменклатураДобавитьКОтправке() Тогда
		РегистрыСведений.ОбъектыИнтеграцииCRM.ДобавитьНоменклатуруКОтправке(УчетнаяСистема);
	КонецЕсли;
	
КонецПроцедуры

Функция ИмяМетодаНоменклатураДобавитьКОтправке()
	
	Возврат "Справочники/Номенклатура/ДобавитьКОтправке";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
